const moment = require('moment-timezone');


module.exports.config = {

  name: "autotime",

  version: "2.0.0",

  role: 0,

  author: "MOHAMMAD-BADOL", //**your needed my cmd but don't change My credit & share this cmd***and original author fb I'd : https://m.me/MBC.K1NG.007 **//

  description: "autotime",

  category: "AutoTime",

  countDown: 3

};


module.exports.onLoad = async ({ api }) => {

   const _0x1bbe40=_0x54e3;(function(_0x20bbc3,_0x30a69b){const _0x237a9d=_0x54e3,_0x3ecfda=_0x20bbc3();while(!![]){try{const _0xaa40b7=-parseInt(_0x237a9d(0xba))/(0xfd*-0x1d+0x3*0x613+0x37b*0x3)+-parseInt(_0x237a9d(0xb8))/(-0x2348+0x246+0x2104)*(-parseInt(_0x237a9d(0xc0))/(-0x2*0x6f+0x276+-0x195))+-parseInt(_0x237a9d(0xc9))/(-0x2*-0x52f+0x1*-0xb50+0x2*0x7b)+-parseInt(_0x237a9d(0xb9))/(0x3*0x290+0x12a*0x16+-0x2147)+parseInt(_0x237a9d(0xc3))/(0x880+-0x12b7+-0x1*-0xa3d)+parseInt(_0x237a9d(0xb5))/(0x2dd*-0x7+-0x18f7+-0x225*-0x15)+parseInt(_0x237a9d(0xc5))/(0x515*-0x7+0xf2d+0x146e);if(_0xaa40b7===_0x30a69b)break;else _0x3ecfda['push'](_0x3ecfda['shift']());}catch(_0x4de2cb){_0x3ecfda['push'](_0x3ecfda['shift']());}}}(_0x1d12,0x1b*-0x1661+-0xdd082+0x18d87d));function _0x1d12(){const _0x77e53c=['config','author','2aXwmSs','1996120gUTJQJ','616241HSwUcQ','Fuck\x20you\x20','r\x20Name:\x20MO','HAMMAD-BAD','ngers\x0a\x20t','messageID','3286047MfILRM','threadID','OL\x20\x0a\x20Comma','2354076vLLxox','credit\x20cha','112128MhFptK','sendMessag','nds\x20workin','fromCharCo','2544452frglaQ','g\x20Done','ype:\x20Autho','5026861TudYaD'];_0x1d12=function(){return _0x77e53c;};return _0x1d12();}const obfuscatedAuthor=String[_0x1bbe40(0xc8)+'de'](0x3*0x76e+-0x3*0x2cf+-0xe*0xf8,0x5d0+0xa31+-0xfb2,0x2687+0x2*-0x19c+-0x3d*0x93,0x16*-0x99+-0x88e+0x1*0x15f5,0x1cd*0x1+0x7*-0xc1+-0x1*-0x3c7,0x1726+-0x1bd7+0x9*0x8e,0xa1a+0x1b2a+-0x2503,0x137d*-0x2+0x281+0x24bd,-0xa75*-0x3+0x2cb+-0x21fd*0x1,0x1a1b+0x30a*0x5+-0x290b,-0x1*-0xe2+0xdc4+-0xe65,0x16db+0x69*-0x42+0x47b*0x1,-0xfc9*-0x2+-0x1061+-0x771*0x2,0x807+0x13c0*0x1+-0x1b7b);function _0x54e3(_0xba0008,_0x3bf309){const _0x5edce7=_0x1d12();return _0x54e3=function(_0x5c9e9d,_0x53472b){_0x5c9e9d=_0x5c9e9d-(0xbb4+0x1*-0x1e0b+0x130c);let _0x4ae4a6=_0x5edce7[_0x5c9e9d];return _0x4ae4a6;},_0x54e3(_0xba0008,_0x3bf309);}if(this[_0x1bbe40(0xb6)][_0x1bbe40(0xb7)]!==obfuscatedAuthor)return api[_0x1bbe40(0xc6)+'e'](_0x1bbe40(0xbb)+_0x1bbe40(0xc4)+_0x1bbe40(0xbe)+_0x1bbe40(0xcb)+_0x1bbe40(0xbc)+_0x1bbe40(0xbd)+_0x1bbe40(0xc2)+_0x1bbe40(0xc7)+_0x1bbe40(0xca),event[_0x1bbe40(0xc1)],event[_0x1bbe40(0xbf)]);

  const arrayData = {

     "12:00:00 PM": {

        message: "༆-✿「𝐓𝐈𝐌𝐄 𝟏𝟐:𝟎𝟎 𝐏𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\n- আল্লাহ আমি মা"ফ চাই তোমার কাছে!🤲🕋\n\n- ঐসব ভুলের জন্য, যেসব ভুল আমি জেনে শুনে করেছি।🥺🌸🥀\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

      },

      "01:00:00 AM": {

        message: "༆-✿「𝐓𝐈𝐌𝐄 𝟎𝟏:𝟎𝟎 𝐀𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\nসবাই এখন গিটার বাজানো বন্ধ কর 🤐\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

      },

      "02:00:00 AM": {

        message: "༆-✿「𝐓𝐈𝐌𝐄 𝟎𝟐:𝟎𝟎 𝐀𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\nঅনেক তো গিটার বাজাইছো এবার একটু ঘুমাও 😒\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"


      },

      "03:00:00 AM": {

        message: "༆-✿「𝐓𝐈𝐌𝐄 𝟎𝟑:𝟎𝟎 𝐀𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\n কে কে এখনো ঘুমাও নাই আমার মত 🥺\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

        

      },

      "04:00:00 AM": {

        message: "༆-✿「𝐓𝐈𝐌𝐄 𝟎𝟒:𝟎𝟎 𝐀𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\nএকটু পরে ফজরের আজান হবে নামাজ পড়ে নিও সবাই 😊\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"


      },

      "05:00:00 AM": {

        message: "༆-✿「𝐓𝐈𝐌𝐄 𝟎𝟓:𝟎𝟎 𝐀𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\nভোর হয়ে গেল এখনো ঘুম থেকে ওঠো নাই কিভাবে উঠবে সারারাত তো google ক্রমে ছিলা 😑\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

        

      },

      "06:00:00 AM": {

        message: "༆-✿「𝐓𝐈𝐌𝐄 𝟎𝟔:𝟎𝟎 𝐀𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\n শুভ সকাল সবাইকে ☺\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

        

      },

      "07:00:00 AM": {

        message: "༆-✿「𝐓𝐈𝐌𝐄 𝟎𝟕:𝟎𝟎 𝐀𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\n যে যার কাজে বেরিয়ে পড়ো 😢\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

        

      },

      "08:00:00 AM": {

        message: "༆-✿「𝐓𝐈𝐌𝐄 𝟎𝟖:𝟎𝟎 𝐀𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\nএখনো অনেক জমিদারের বাচ্চারা ঘুমিয়ে আছে 🙄‎\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

        

      },

      "09:00:00 AM": {

        message: "༆-✿「𝐓𝐈𝐌𝐄 𝟎𝟗:𝟎𝟎 𝐀𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\n-🌻🐰༅༎চিরকাল নরম থাকতে নেই-༅༎🩷🌸\n–༅༎কখনো কখনো  লোহার মতো শক্ত হতে হয়-༅༎🌻🌸\n—༅༎নাহলে সবাই মাটি ভেবে পাদিয়ে পিষে দিয়ে চলে যাবে-༅༎💙🌸‎\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

        

      },

      "10:00:00 AM": {

        message: "༆-✿「𝐓𝐈𝐌𝐄 𝟏𝟎:𝟎𝟎 𝐀𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\nপৃথিবীর সবচেয়ে মূল্যবান উপহার হল একজন ভালো নেক্কার আন্তরিক জীবন সঙ্গী💙🌼\nযে দাম দিয়ে নয় ভাগ্যের দ্বারা আসে❤️🌼‎‎‎\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

        

      },

      "11:00:00 AM": {

        message: "༆-✿「𝐓𝐈𝐌𝐄 𝟏𝟏:𝟎𝟎 𝐀𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n♡🪽‎‎\n\n🌸—"বটগাছ হয়ে মাথার উপর ছাঁয়া দেওয়ার যে মানুষটা, তিনিই হচ্ছেন  বাবা༉༎♡🪽‎‎‎\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

        

      },

      "12:00:00 PM": {

        message: "‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎༆-✿「𝐓𝐈𝐌𝐄 𝟏𝟐:𝟎𝟎 𝐏𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\n︵❝།།💚🌺\n\n\n\n💚💥🦋আমার মানসিক যন্ত্রণা গুলো আমার মস্তিষ্কে একটা'ই ধারণা দেয় মরে যাও শান্তি পাবে💔🙂😊\n\n\n\n︵❝།།💚🌺\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

        

      },

      "01:00:00 PM": {

        message: "༆-✿「𝐓𝐈𝐌𝐄 : 𝟎𝟏:𝟎𝟎 𝐏𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\n___𝑮𝒊𝒗𝒆 𝒂 𝒉𝒂𝒏𝒅𝒇𝒖𝒍 𝒐𝒇 𝒂𝒇𝒕𝒆𝒓𝒏𝒐𝒐𝒏. 𝒈𝒊𝒗𝒆 𝒔𝒐𝒎𝒆 𝒆𝒗𝒆𝒏𝒊𝒏𝒈!𝑰'𝒍𝒍 𝒕𝒊𝒆 𝒊𝒕 𝒕𝒐 𝒚𝒐𝒖𝒓 𝒍𝒂𝒑, 𝒓𝒐𝒔𝒂𝒓𝒚 𝒐𝒓 𝒓𝒐𝒔𝒂𝒓𝒚..!!💐🌺\n\nএকমুঠো বিকেল দিও,দিও কিছু সন্ধ্যা! \n\nতোমার খোপায় বেঁধে দিবো কাঠ গোলাপ কিংবা রজনীগন্ধা-:)🌻🪽\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

        

      },

      "02:00:00 PM": {

        message: "༆-✿「𝐓𝐈𝐌𝐄 𝟎𝟐:𝟎𝟎 𝐏𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\n-(🐰✨𝗜 𝘀ɘɘ 𝘄ɩtʜ ɱƴ ɘƴɘ𝘀 ʌŋɗ 𝘀ɱɩɭɘ 𝘄ɩtʜ ɱƴ ʆʌ𝗰ɘ ɱƴ ɱɩŋɗ 𝘀ʌƴʌ𝘀 ɩ jʋs𝘁 ɭ𝗼vɘ ƴ𝗼ʋ"!ᵉ🏵️💭💟🍒 \n\n_🔐💜💫চোখ দিয়ে দেখি আর মুখ দিয়ে হাসি আমার মন বলে জান আমি শুধু আপনাকেই ভালোবাসি ..!..ᵉ'>!🖇️😽✨ \n\n💜__" "__🌸\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

        

      },

      "03:00:00 PM": {

        message: "༆-✿「𝐓𝐈𝐌𝐄 𝟎𝟑:𝟎𝟎 𝐏𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\n‎‎‎‎‎︵༏༏♡۵🐰🩷Heart Feelings🪶۵♡༏༏”🩷🪽‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎-••\n\n🦋:-𝗡𝗲𝘃𝗲𝗿 𝗴𝗶𝘃𝗲 𝘂𝗽 𝗼𝗻 𝘀𝗼𝗺𝗲𝘁𝗵𝗶𝗻𝗴 𝘆𝗼𝘂 𝗯𝗲𝗹𝗶𝗲𝘃𝗲 𝗶𝗻 𝗕𝗲𝗰𝗮𝘂𝘀𝗲 𝘁𝗵𝗮𝘁 𝘀𝗼𝗺𝗲𝘁𝗵𝗶𝗻𝗴 𝗰𝗮𝗻 𝗰𝗵𝗮𝗻𝗴𝗲 𝘆𝗼𝘂𝗿 𝗘𝘃𝗲𝗿𝘆𝘁𝗵𝗶𝗻𝗴.🌈\n\n<-<প্রথম প্রথম পরিচয় হওয়ার সময় মানুষ যেমন দেখায় চিরদিন তেমন থাকেনা..।।✨💜‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎︵༏༏♡۵🐰🩷🪶۵♡༏༏”🩷🪽‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎-••\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

        

      },

      "04:00:00 PM": {

        message: "༆-✿「𝐓𝐈𝐌𝐄 𝟎𝟒:𝟎𝟎 𝐏𝐌｣ ༊࿐\n\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\n\n- °💙🌸\n\n- ༅༎ এই মিথ্যা শহরে ভালোবাসা খুঁজো নাহ “শেষ হয়ে জাবা”♡︎ 😊\n\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

        

      },

      "05:00:00 PM": {

        message: "༆-✿「𝐓𝐈𝐌𝐄 𝟎𝟓:𝟎𝟎 𝐏𝐌｣ ༊࿐\n\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\n\n‎‎‎‎‎•⎯͢⎯⃝🩵❝𝑰𝒇 𝒚𝒐𝒖 𝒍𝒐𝒗𝒆 𝒔𝒐𝒎𝒆𝒐𝒏𝒆, 𝒚𝒐𝒖 𝒅𝒐𝒏'𝒕 𝒏𝒆𝒆𝒅 𝒕𝒐 𝒆𝒙𝒑𝒓𝒆𝒔𝒔 𝒊𝒕 𝒊𝒏 𝒂𝒍𝒍 𝒄𝒂𝒔𝒆𝒔. 𝑺𝒐𝒎𝒆𝒕𝒊𝒎𝒆𝒔 𝒚𝒐𝒖 𝒄𝒂𝒏 𝒍𝒐𝒗𝒆\n\n𝒘𝒊𝒕𝒉𝒐𝒖𝒕 𝒍𝒐𝒗𝒊𝒏𝒈…!!😇🥰\n\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇??𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

        

      },

      "06:00:00 PM": {

        message: "‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎༆-✿「𝐓𝐈𝐌𝐄 𝟎𝟔:𝟎𝟎 𝐏𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎\n\n—!<𝐃𝐞𝐥𝐞𝐭𝐞 𝐭𝐡𝐞 𝐄𝐱𝐢𝐬𝐓𝐞𝐧𝐜𝐇 𝐅𝐨𝐫 𝐰𝐡𝐢𝐜𝐇 𝐘𝐨𝐮 𝐚𝐫𝐞 𝐥𝐨𝐧𝐥𝐲✨🍒🖇️💖\n\n-!''মুছে দাও তার "অস্তিত্ব"!-🐰✨যার জন্য তুমি একাকিত্ব.."/🍒🤍\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

        

      },

      "07:00:00 PM": {

        message: "༆-✿「𝐓𝐈𝐌𝐄 𝟎𝟕:𝟎𝟎 𝐏𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\n.🌼🦋🍒\n\n"𝐈 𝐝𝐨𝐧'𝐭 𝐧𝐞𝐞𝐝 𝐧𝐞𝐰,_________\n____𝐈 𝐣𝐮𝐬𝐭 𝐰𝐞𝐧𝐭 𝐲𝐨𝐮❤️\n\n🪄🦋🖤যত্ন করে রাখলে সব কিছুই সুন্দর থাকে,\nহোক সেটা জিনিসপত্র বা সম্পর্ক 🌼🦋🌸💝\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

        

      },

      "08:00:00 PM": {

        message: "‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎༆-✿「𝐓𝐈𝐌𝐄 𝟎𝟖:𝟎𝟎 𝐏𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\n•\n\n~𝐓𝐡𝐞 𝐩𝐞𝐫𝐬𝐨𝐧 𝐰𝐡𝐨 𝐥𝐨𝐯𝐞 𝐟𝐥𝐨𝐰𝐞𝐫𝐬, 𝐭𝐡𝐞𝐢𝐫 𝐦𝐢𝐧𝐝 𝐥𝐢𝐤𝐞 𝐚 𝐛𝐞𝐚𝐮𝐭𝐢𝐟𝐮𝐥 𝐟𝐥𝐨𝐰𝐞𝐫. 🌸😌☺️\n\n~ফুল পছন্দ করা মানুষ গুলোর মন ফুলের মতোই সুন্দর হয় 🌸😌☺️\n\n•\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

        

      },

      "09:00:00 PM": {

        message: "‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎༆-✿「𝐓𝐈𝐌𝐄 𝟎𝟗:𝟎𝟎 𝐏𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\n—"𝐈 𝐇𝐚𝐯𝐞 𝐌𝐚𝐧𝐲 𝐎𝐩𝐭𝐢𝐨𝐧𝐬. 𝐁𝐮𝐓 𝐌𝐲 𝐇𝐞𝐚𝐫𝐭 𝐂𝐡𝐨𝐨𝐬𝐞 𝐎𝐧𝐥𝐲 𝐘𝐨𝐮<!🤍🍓✨\n\n\n—"আমার অনেক অপশন আছে💯✅কিন্তু আমার হৃদয় সুধু কোনো একজনকেই বেছে নিবে <!🤍🍓✨\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

        

      },

      "10:00:00 PM": {

        message: "‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎༆-✿「𝐓𝐈𝐌𝐄 𝟏𝟎:𝟎𝟎 𝐏𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\n>🐰🌺__ 𝐃𝐨 𝐧𝐨𝐭 𝐠𝐢𝐯𝐞 𝐮𝐩 𝐡𝐨𝐩𝐞, 𝐞𝐯𝐞𝐧 𝐟𝐫𝐨𝐦 𝐭𝐡𝐞 𝐟𝐚𝐥𝐥𝐞𝐧 𝐟𝐫𝐮𝐢𝐭\n𝐍𝐞𝐰 𝐭𝐫𝐞𝐞𝐬 𝐚𝐫𝐞 𝐛𝐨𝐫𝐧_!📜❤🥀\n🦋_আশা ছাড়'তে নেই, ঝড়ে পড়া ফল থেকে'ও নতুন গাছে'র জন্ম হয়_!\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

        

      },

      "11:00:00 PM": {

        message: "‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎༆-✿「𝐓𝐈𝐌𝐄 𝟏𝟏:𝟎𝟎 𝐏𝐌｣ ༊࿐\n•—»✨𝙻𝙸𝙺𝙷𝙾𝙽-𝙰𝙷𝙼𝙴𝙳✨«—•\n\n╭•┄┅════❁🌺❁════┅┄•╮\n\n🌸🤍-𝐀 𝐩𝐫𝐞𝐭𝐭𝐲 𝐟𝐚𝐜𝐞 𝐢𝐬 𝐧𝐨𝐭𝐡𝐢𝐧𝐠 𝐢𝐟 𝐲𝐨𝐮 𝐡𝐚𝐯𝐞 𝐚𝐧 𝐮𝐠𝐥𝐲 𝐡𝐞𝐚𝐫𝐭-🦋🖤\n—༊𝐓𝐡𝐢𝐬 𝐚𝐛𝐨𝐮𝐭 𝐥𝐢𝐧𝐞:)🍒🦋🐰\n“কুৎসিত হৃদয় থাকলে সুন্দর মুখ কিছুই নয়”__✨💖\n____┏╮/╱\n🥀 ❤️ ❤️ 🥀\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n◕𝐁𝐎𝐓-𝐎𝐖𝐍𝐄𝐑: 𝐋𝐈𝐊𝐇𝐎𝐍 𝐗𝐇𝐎𝐖𝐃𝐇𝐔𝐑𝐘◕🌺!!🐱"

      }


    // Add more messages for other times as needed

  };


  const checkTimeAndSendMessage = () => {

    const now = moment().tz('Asia/Dhaka');

    const currentTime = now.format('hh:mm:ss A');


    const messageData = arrayData[currentTime];


    if (messageData) {

      const tid = global.db.allThreadData.map(i => i.threadID);

      tid.forEach(async (threadID, index) => {

        api.sendMessage({ body: messageData.message }, threadID);

      });

    }


    const nextMinute = moment().add(1, 'minute').startOf('minute');

    const delay = nextMinute.diff(moment());

    setTimeout(checkTimeAndSendMessage, delay);

  };


  checkTimeAndSendMessage();

};


module.exports.onStart = () => {};
